# Selection

In [2]:
import pandas as pd
import numpy as np

In [14]:
data = {
    "Actor": ["Johnny", "Robert", "Dwayne", "Tom", "Tom"],
    "Age":[51, 54, 55, 45, 60],
    "Address": ["NYC", "California", "Texas", "New Jersi", "Chicago"],
    "Movies": ["Pirates of Caribbean", "Iron Man", "The Mummy", "The Revenant", "Forrest Gump"]
}
df = pd.DataFrame(data)
df

    Actor  Age     Address                Movies
0  Johnny   51         NYC  Pirates of Caribbean
1  Robert   54  California              Iron Man
2  Dwayne   55       Texas             The Mummy
3     Tom   45   New Jersi          The Revenant
4     Tom   60     Chicago          Forrest Gump

## Column selection

In [15]:
df.Actor

0    Johnny
1    Robert
2    Dwayne
3       Tom
4       Tom
Name: Actor, dtype: object

In [16]:
df.Age

0    51
1    54
2    55
3    45
4    60
Name: Age, dtype: int64

In [17]:
df[['Actor','Age']]

    Actor  Age
0  Johnny   51
1  Robert   54
2  Dwayne   55
3     Tom   45
4     Tom   60

## Row selection

In [18]:
df[df.Actor == "Dwayne"]

    Actor  Age Address     Movies
2  Dwayne   55   Texas  The Mummy

In [19]:
df[(df.Actor == "Tom") & (df.Movies == "Forrest Gump")]

  Actor  Age  Address        Movies
4   Tom   60  Chicago  Forrest Gump

In [20]:
df[df.Age > 54]

    Actor  Age  Address        Movies
2  Dwayne   55    Texas     The Mummy
4     Tom   60  Chicago  Forrest Gump

## LOC[]

In [24]:
df

    Actor  Age     Address                Movies
0  Johnny   51         NYC  Pirates of Caribbean
1  Robert   54  California              Iron Man
2  Dwayne   55       Texas             The Mummy
3     Tom   45   New Jersi          The Revenant
4     Tom   60     Chicago          Forrest Gump

In [32]:
df.loc[1] # like index

Actor          Robert
Age                54
Address    California
Movies       Iron Man
Name: 1, dtype: object

In [33]:
df.loc[[1]] # See the difference

    Actor  Age     Address    Movies
1  Robert   54  California  Iron Man

In [26]:
df.loc[[1,3]]

    Actor  Age     Address        Movies
1  Robert   54  California      Iron Man
3     Tom   45   New Jersi  The Revenant

In [42]:
df.loc[[1,4], ['Actor', 'Age']]

    Actor  Age
1  Robert   54
4     Tom   60

In [44]:
df.loc[:, ['Address', 'Movies']]

      Address                Movies
0         NYC  Pirates of Caribbean
1  California              Iron Man
2       Texas             The Mummy
3   New Jersi          The Revenant
4     Chicago          Forrest Gump

## ILOC[]
Integeral position

In [46]:
df.iloc[[1]]

    Actor  Age     Address    Movies
1  Robert   54  California  Iron Man

In [50]:
df.iloc[0:3]

    Actor  Age     Address                Movies
0  Johnny   51         NYC  Pirates of Caribbean
1  Robert   54  California              Iron Man
2  Dwayne   55       Texas             The Mummy

In [55]:
df.iloc[0:3, [1]]

   Age
0   51
1   54
2   55

In [57]:
df.iloc[0:3, 1:4]

   Age     Address                Movies
0   51         NYC  Pirates of Caribbean
1   54  California              Iron Man
2   55       Texas             The Mummy